In [1]:
l1=[1,2,3,4]
l2=[5,6,7,8]
l3=[6,5,7,8]

In [2]:
l=[l1,l2,l3]

In [3]:
list(range(10,40,3))

[10, 13, 16, 19, 22, 25, 28, 31, 34, 37]

In [32]:
l = [1,2,2,2,2,3,4,5,6,7,8,9,10]
print(l)
for o in l:
    if o==2:
        l.remove(o)
        print(l)
print(l)

[1, 2, 2, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [40]:
lst = [1, 2, 3, 4, 5, 6, 7, 8]
[x for x in lst if x == 2]

[2]

In [48]:
l = [1,2,2,2,2,3,4,5,6,7,8,9,10]
l = [x for x in l if x != 2]
print(l)

[1, 3, 4, 5, 6, 7, 8, 9, 10]

In [4]:
l = ['India','Australia','Italy','France']
l

['India', 'Australia', 'Italy', 'France']

In [5]:
{i[0]:i for i in l}

{'I': 'Italy', 'A': 'Australia', 'F': 'France'}

In [6]:
{x:x**2 for x in range(10)}

{0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81}

In [9]:
{x:x**2 for x in range(10) if  x%2 ==0}

{0: 0, 2: 4, 4: 16, 6: 36, 8: 64}

In [8]:
def sqr(num):
    for n in range(1,num+1):
        yield  n**2

In [9]:
sqr_num=sqr(5)
for i in sqr_num:
    print(i)

1
4
9
16
25

In [1]:
def SpicyChicken(low, high):
    for i in range(low,high+1):
        print(i, end="")
        if i%3==0:
            print(" Spicy", end="")
            if i%5==0:
                print("Chicken!", end="")
        elif i%5==0:
            print(" Chicken", end="")
        print()

def getMinNumber():
    flag=1
    while flag==1:
        min = int(input("Enter min value:"))
        if min<=0 or min>100:
            print("Enter a number between 1 and 100")
        else:
            flag=0
    return min

def getMaxNumber(min):
    flag=1
    while flag==1:
        max = int(input("Enter max value:"))
        if max>100 or max<min:
            print("Enter a number between", min, " and 100")
        else:
            flag=0
    return max

In [4]:
min = getMinNumber()
max = getMaxNumber(min)
SpicyChicken(min,max)

Enter min value:50
Enter max value:45
Enter a number between 50  and 100
Enter max value:50
50 Chicken

In [61]:
            
def reverse(s): 
    revstr = "" 
    for i in s:
        if i=='!' or i==',' or i=='.' or i=='?':
            print(revstr[0:1])
            revstr = " " + revstr
            revstr = i + revstr
            print(revstr)
        elif revstr[0:1]=='!' or revstr[0:1]==',' or revstr[0:1]=='.' or revstr[0:1]=='?':
            if i != ' ':
                revstr = i + revstr
        else:
            revstr = i + revstr
    
    return(revstr.title())



str = "hello world, blah blah"
revstr=reverse(str)
revstr

d
, dlrow olleh

'Halb Halb, Dlrow Olleh'

In [64]:
def calculateTax(income):
# Write your code here
    if income<=18200:
        tax=0
    elif income<=37000:
        tax=(income-18200)*0.19
    elif income<=87000:
        tax=(37000-18200)*0.19
        tax= tax + ((income - 37000) * 0.325)
    elif income <= 180000:
        tax=(37000-18200)*0.19
        tax=tax+(87000-37000)*0.325
        tax = tax + ((income - 87000)*0.37)
    else:
        tax=(37000-18200)*0.19
        tax=tax+(87000-37000)*0.325
        tax=tax+(180000-87000)*0.37
        tax = tax + ((income - 180000)*0.45)
    return round(tax,2)

In [66]:
print(calculateTax(180001))

54232.45

In [7]:
class A():
    def test(self):
        print('A')

class B(A):
    def test(self):
        print('B')

testobj = B()
testobj.test()

B

In [8]:
import numpy as np
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/akhil12028/Bank-Marketing-data-set-analysis/master/bank-additional-full.csv', sep=';')
df.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [9]:
df.tail(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [10]:
df.rename(columns={"job": "profession"})

,age,profession,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,56,retired,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [16]:
df[['age']]

       age
0       56
1       57
2       37
3       40
4       56
...    ...
41183   73
41184   46
41185   56
41186   44
41187   74

[41188 rows x 1 columns]

In [23]:
df['age'].dtypes

dtype('int64')

In [22]:
df.isnull().values.any()

False

In [7]:
def sent_has_animal(sentence:str) ->  bool:
    return "animal" in sentence

sent_has_animal("Donald had a farm without animals")

True